Revit 2017 API
Rebar.ConstraintsCanBeEdited Method
 Returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. Examples of where this method would return false are: Rebar in Groups (which do not have constraints), or legacy, sketch-based Rebar elements created before the introduction of RebarShape families in version 2009.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public bool ConstraintsCanBeEdited()
Visual Basic
Public Function ConstraintsCanBeEdited As Boolean
Visual C++
public:
bool ConstraintsCanBeEdited()
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace